shared/home/dot-emacs.d/config.org
#+TITLE: Juank's Emacs Config
#+AUTHOR: Juan Camilo Prada
#+EMAIL: juankprada@gmail.com
#+LANGUAGE: en
#+OPTIONS: ':t toc:nil author:t email:t num:t
#+STARTUP: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last revised and exported on {{{latest-export-date}}} with a word
count of {{{word-count}}}.*

This is my last attempt at keeping a dot-emacs file consistant accross
multiple devices with multiple operating systems.

This is by far not a finished product. In fact it's constantly changing
and eveolving. I take ideas from many places (Specially from Protesilaos' own dot-files <https://protesilaos.com/>).

Like Protesilaos' config. This one is a litarete configuration
not intended to be loaded at runtime due to perfomance reasons. And like
his, the *.el* files are generated only after evaluating the following line from
emacs ( by running  =C-c C-v C-t= )


#+begin_src emacs-lisp :tangle no :results none
  (org-babel-tangle)
#+end_src


* Structure of the emacs configuration

As mentioned before this file is not directly loaded. Instead, after evaluating
and generating the =config.org= several files are generated for easy maintenance.

- The standard =early-init.el= :: Includes optimizations for fast startup and some
  basic settings related to UI, like disabling tool-bars and scroll-bars.

- The standard =init.el= :: Contains the main settings of this configuration
  and most of the settings here are related to the functionallity of emacs's core.
  Extra packages (i.e for programming modes and custom extended functionallity is stored in the next
  described file.

- The custom =juank-emacs-modules= directory :: Here you will find all the configuration
  related to packages and modules installed (i.e. plugins). Most programming related
  modes' settings end up here.




** Early Initialization of emacs (=init.el=)

This is the first file that emacs will load and evaluates when starting up.  Code here
is intended to set up basic grounds for a fast startup before delegating
the rest of the configuration to the standard =init.el= file.


*** =init.el= The Garbage Collection and startup time improvements

Garbage collection seems to be a pretty important part of improving emacs'
startup time. By increasing the amount of memory before the garbage collector
runs we make sure that it runs 'less' during the startup and thus causes
less delays.

We also prevent unwanted runtime compilation (this is for gccemacs or native-comp).
Packages should be compiles ahead-of-time when they are installed and site files
are supposed to be compile when gccemacs is installed.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq gc-cons-threshold most-positive-fixnum)

  (setq native-comp-deferred-compilation nil ;; obsolete since 29.1
        native-comp-jit-compilation nil)

#+end_src

*** =init.el= Disabling package initialization

*NOTE:* This setting here is experimental. The idea is to
still rely on =package.el= but we will see how disabling it at startup works.

Let's prevent packake initialize to ocur before our =init.el= file is leaded.
This should improve startup time as things should (as much as possible)
be lazy-loaded.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq package-enable-at-startup nil)

  ;; `use-package' is builtin since 29.
  ;; It must be set before loading `use-package'.
  (setq use-package-enable-imenu-support t)
#+end_src

*** =init.el= Custom GUI settings

We really dont want UI elements distracting us from the things
we want to do in emacs (coding). Thus things like scroll-bars,
tool-bars, etc are disabled as early as possible.

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Inhibit resizing frame
  (setq frame-inhibit-implied-resize t)

  ;; Faster to disable these here (before they've been initialized)
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (when (featurep 'ns)
    (push '(ns-transparent-titlebar . t) default-frame-alist))
  (setq-default mode-line-format nil)


  ;; Prevent flashing of unstyled modeline at startup
  (setq-default mode-line-format nil)
#+end_src


** The Main initializatin of emacs (=init.el=)

This is where all individual modules are loaded and custom macros and definitions are set.


*** =init.el= Disable native-compilation verbosity
I usually compile emacs with =--with-native-compilation=yes= option which enables native compilation
of Emacs Lisp. But by default, this compilation proces is very verbose and clutters the Emacs compile buffer/messages.
Here we make it silent.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Make native compilation silent and prune its cache.
  (when (native-comp-available-p)
    (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
    (setq native-compile-prune-cache t)) ; Emacs >=29
#+end_src

*** =init.el= Custom intialization configurations

#+begin_src emacs-lisp :tangle "init.el"
  (unless (or (daemonp) noninteractive init-file-debug)
    ;; Suppress file handlers operations at startup
    ;; `file-name-handler-alist' is consulted on each call to `require' and `load'
    (let ((old-value file-name-handler-alist))
      (setq file-name-handler-alist nil)
      (set-default-toplevel-value 'file-name-handler-alist file-name-handler-alist)
      (add-hook 'emacs-startup-hook
                (lambda ()
                  "Recover file name handlers."
                  (setq file-name-handler-alist
                        (delete-dups (append file-name-handler-alist old-value))))
                101)))

#+end_src

*** =init.el= Load my custom modules and lisp packages

#+begin_src emacs-lisp :tangle "init.el"
  (defun update-load-path (&rest _)
    "Update `load-path'."
    (dolist (dir '("juank-lisp" "juank-emacs-modules"))
      (push (expand-file-name dir user-emacs-directory) load-path)))

  (defun add-subdirs-to-load-path (&rest _)
    "Add subdirectories to `load-path'.

  Don't put large files in `juank-lisp' directory, e.g. EAF.
  Otherwise the startup will be very slow."
    (let ((default-directory (expand-file-name "juank-lisp" user-emacs-directory)))
      (normal-top-level-add-subdirs-to-load-path)))

#+end_src

After defining the way my custom packages will be loaded
we advice =package-initialize= to load after upidatingh the =load-path= 

#+begin_src emacs-lisp :tangle "init.el"
  (advice-add #'package-initialize :after #'update-load-path)
  (advice-add #'package-initialize :after #'add-subdirs-to-load-path)

  (update-load-path)
#+end_src

*** =init.el= Loading of custom modules

As mentioned before, this configuration is split into several modules. Most of the specifics of how
this config works are degined within these modules and here is the place where they are loaded.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Requisites
  (require 'init-const)
  (require 'init-funcs)

  ;; ;; Packages
  (require 'init-package)

  ;; ;; Preferences
  (require 'init-base)
  (require 'init-ui)


  (require 'init-edit)
  (require 'init-completion)
  (require 'init-bookmarks)
  (require 'init-dashboard)
  (require 'init-highlight)
  (require 'init-dired)

  (require 'init-ibuffer)
  (require 'init-treemacs)

  ;; (require 'init-eshell)
  ;; (require 'init-shell)

  (require 'init-markdown)
  (require 'init-org)
  (require 'init-dict)
  (require 'init-utils)

  ;; ;; Programming
  (require 'init-vcs)

  (require 'init-lsp)
  ;; (require 'init-dap)

  (require 'init-prog)
  (require 'init-python)
  (require 'init-ruby)
  (require 'init-web)

  ;; (require 'init-elisp)



#+end_src



** Juank Emacs Modules - Custom settings defined in =juank-emacs-modules/=.


*** =init-const.el= Custom detinitions and constants.

There are severlal initial constants to be defined to identify which environmnent
is actually running Emacs. This helps for other packages to modify their
behaviour based on the platform (i.e. Linux, Windows or MacOS)

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-const.el"
  ;; init-const.el --- Define constants.	-*- lexical-binding: t -*-

  ;;
  ;; Define constants.
  ;;

    ;;; Code:
  (defconst sys/win32p
    (eq system-type 'windows-nt)
    "Are we running on a WinTel system?")

  (defconst sys/linuxp
    (eq system-type 'gnu/linux)
    "Are we running on a GNU/Linux system?")

  (defconst sys/macp
    (eq system-type 'darwin)
    "Are we running on a Mac system?")

  (defconst sys/mac-x-p
    (and (display-graphic-p) sys/macp)
    "Are we running under X on a Mac system?")

  (defconst sys/mac-ns-p
    (eq window-system 'ns)
    "Are we running on a GNUstep or Macintosh Cocoa display?")

  (defconst sys/mac-cocoa-p
    (featurep 'cocoa)
    "Are we running with Cocoa on a Mac system?")

  (defconst sys/mac-port-p
    (eq window-system 'mac)
    "Are we running a macport build on a Mac system?")

  (defconst sys/linux-x-p
    (and (display-graphic-p) sys/linuxp)
    "Are we running under X on a GNU/Linux system?")

  (defconst sys/cygwinp
    (eq system-type 'cygwin)
    "Are we running on a Cygwin system?")

  (defconst sys/rootp
    (string-equal "root" (getenv "USER"))
    "Are you using ROOT user?")

  (defconst emacs/>=27p
    (>= emacs-major-version 27)
    "Emacs is 27 or above.")

  (defconst emacs/>=28p
    (>= emacs-major-version 28)
    "Emacs is 28 or above.")

  (defconst emacs/>=29p
    (>= emacs-major-version 29)
    "Emacs is 29 or above.")

  (defconst emacs/>=30p
    (>= emacs-major-version 30)
    "Emacs is 30 or above.")

  (provide 'init-const)
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; init-const.el ends here

#+end_src

