shared/home/dot-emacs.d/config.org
*** =init-package.el= Packages definition.

This is probably one of the most important places of all the configuration.
In this file the =package.el= specific settings are defined, as well as the
dependencies for this configuration to work (i.e the list of packages to install).

We start by setting the repositories that we will use.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-package.el"
  ;;; init-package.el --- Initialize package configurations.	-*- lexical-binding: t -*-
  ;;; Commentary:
  ;;
  ;; Emacs Package management configurations.
  ;;

  ;;; Code:
  (eval-when-compile
    (require 'init-const)
    (require 'init-funcs)
    (require 'package))

  (setq package-vc-register-as-project nil) ; Emacs 30

  (add-hook 'package-menu-mode-hook #'hl-line-mode)

  (setq package-archives
        '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
          ("melpa" . "https://melpa.org/packages/")
          ("org" . "http://orgmode.org/elpa/")))

  ;; Highest number gets priority (what is not mentioned has priority 0)
  (setq package-archive-priorities
        '(("gnu-elpa" . 4)
          ("melpa" . 3)
          ("nongnu" . 2)
          ("org" . 1)))

  ;; NOTE 2023-08-21: I build Emacs from source, so I always get the
  ;; latest version of built-in packages.  However, this is a good
  ;; solution to set to non-nil if I ever switch to a stable release.
  (setq package-install-upgrade-built-in nil)


#+end_src

I decided that I will use the =use-package= macro to handle my depenencies and configuration.
This is due the the possibility to control lazy loading of packages.

I still need to investigate more about it and how to better tweak it.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-package.el"
  (unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
    (setq package-enable-at-startup nil)          ; To prevent initializing twice
    (package-initialize))



  ;; Setup `use-package'
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  ;; Set some sensible defaults for use-package
  (setq use-package-always-ensure t
        use-package-always-defer t
        use-package-expand-minimally t
        use-package-enable-imenu-support t)

  ;; Required by `use-package'
  (use-package diminish :ensure t)


  ;; Update GPG keyring for GNU ELPA
  (use-package gnu-elpa-keyring-update)

  ;; Update packages
  (unless (fboundp 'package-upgrade-all)
    (use-package auto-package-update
      :init
      (setq auto-package-update-delete-old-versions t
            auto-package-update-hide-results t)
      (defalias 'package-upgrade-all #'auto-package-update-now)))

  (provide 'init-package)
#+end_src

