shared/home/dot-emacs.d/config.org
**** Some extra config

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-ui.el"
  
  ;; Display dividers between windows
  (setq window-divider-default-places t
        window-divider-default-bottom-width 1
        window-divider-default-right-width 1)
  (add-hook 'window-setup-hook #'window-divider-mode)



  ;; Mouse & Smooth Scroll
  ;; Scroll one line at a time (less "jumpy" than defaults)
  (when (display-graphic-p)
    (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
          mouse-wheel-scroll-amount-horizontal 1
          mouse-wheel-progressive-speed nil))
  (setq scroll-step 1
        scroll-margin 10
        scroll-conservatively 100000
        auto-window-vscroll nil
        scroll-preserve-screen-position t)

  ;; Horizontal  Scroll
  (setq hscroll-step 1)
  (setq hscroll-margin 1)



  ;; Good pixel line scrolling
  (if (fboundp 'pixel-scroll-precision-mode)
      (pixel-scroll-precision-mode t)
    (unless sys/macp
      (use-package good-scroll
        :diminish
        :hook (after-init . good-scroll-mode)
        :bind (([remap next] . good-scroll-up-full-screen)
               ([remap prior] . good-scroll-down-full-screen)))))

  ;; Smooth scrolling over images
  (unless emacs/>=30p
    (use-package iscroll
      :diminish
      :hook (image-mode . iscroll-mode)))

  ;; Use fixed pitch where it's sensible
  (use-package mixed-pitch
    :diminish)

  ;; Display ugly ^L page breaks as tidy horizontal lines
  (use-package page-break-lines
    :diminish
    :hook (after-init . global-page-break-lines-mode))

  ;; Child frame

  (use-package posframe
    :hook (after-load-theme . posframe-delete-all)
    :init
    (defface posframe-border
      `((t (:inherit region)))
      "Face used by the `posframe' border."
      :group 'posframe)
    (defvar posframe-border-width 2
      "Default posframe border width.")
    :config
    (with-no-warnings
      (defun my-posframe--prettify-frame (&rest _)
        (set-face-background 'fringe nil posframe--frame))
      (advice-add #'posframe--create-posframe :after #'my-posframe--prettify-frame)

      (defun posframe-poshandler-frame-center-near-bottom (info)
        (cons (/ (- (plist-get info :parent-frame-width)
                    (plist-get info :posframe-width))
                 2)
              (/ (+ (plist-get info :parent-frame-height)
                    (* 2 (plist-get info :font-height)))
                 2)))))

  (with-no-warnings
    (when sys/macp
      ;; Render thinner fonts
      (setq ns-use-thin-smoothing t)
      ;; Don't open a file in a new frame
      (setq ns-pop-up-frames nil)))


  ;; Don't use GTK+ tooltip
  (when (boundp 'x-gtk-use-system-tooltips)
    (setq x-gtk-use-system-tooltips nil))

  ;; ignore bell alarm completely
  (setq ring-bell-function 'ignore)
#+end_src



Finally we finishes the setup of UI.
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-ui.el"
  (provide 'init-ui)
#+end_src


*** =init-edit.el= Edition and writing related configuration

This section starts with some sensible defaults that, in my opinion
should be default in emacs.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  ;; init-edit.el --- Define constants.	-*- lexical-binding: t -*-

  ;;
  ;; Define constants.
  ;;

    ;;; Code:


  ;; Delete selection if you insert
  (use-package delsel
    :ensure nil
    :hook (after-init . delete-selection-mode))

  ;; Automatically reload files was modified by external program
  (use-package autorevert
    :ensure nil
    :diminish
    :hook (after-init . global-auto-revert-mode))

  ;; Automatic parenthesis pairing
  (use-package elec-pair
    :ensure nil
    :hook (after-init . electric-pair-mode)
    :init (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))

  ;; Show number of matches in mode-line while searching
  (use-package anzu
    :diminish
    :bind (([remap query-replace] . anzu-query-replace)
           ([remap query-replace-regexp] . anzu-query-replace-regexp)
           :map isearch-mode-map
           ([remap isearch-query-replace] . anzu-isearch-query-replace)
           ([remap isearch-query-replace-regexp] . anzu-isearch-query-replace-regexp))
    :hook (after-init . global-anzu-mode))

#+end_src


**** Edition of multiple regions
Sometimes it is necessary to edit multiple regions. Based on "similar" text
or a custom defined rectangular region. iedit achieves this.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  ;; Edit multiple regions in the same way simultaneously
  (use-package iedit
    :defines desktop-minor-mode-table
    :bind (("C-;" . iedit-mode)
           ("C-|" . iedit-rectangle-mode)
           :map isearch-mode-map ("C-;" . iedit-mode-from-isearch)
           :map esc-map ("C-;" . iedit-execute-last-modification)
           :map help-map ("C-;" . iedit-mode-toggle-on-function))
    :config
    ;; Avoid restoring `iedit-mode'
    (with-eval-after-load 'desktop
      (add-to-list 'desktop-minor-mode-table
                   '(iedit-mode nil))))
#+end_src

**** Avy. Jumping to things in emacs tree-style

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  ;; Jump to things in Emacs tree-style
  (use-package avy
    :bind (("C-:"   . avy-goto-char)
           ("C-'"   . avy-goto-char-2)
           ("M-g l" . avy-goto-line)
           ("M-g w" . avy-goto-word-1)
           ("M-g e" . avy-goto-word-0))
    :hook (after-init . avy-setup-default)
    :config (setq avy-all-windows nil
                  avy-all-windows-alt t
                  avy-background t
                  avy-style 'pre))


  (use-package avy-zap
    :bind (("M-z" . avy-zap-to-char-dwim)
           ("M-Z" . avy-zap-up-to-char-dwim)))
#+end_src 

**** Ediff A decent Diff tool

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  (use-package ediff
    :ensure nil
    :hook(;; show org ediffs unfolded
          (ediff-prepare-buffer . outline-show-all)
          ;; restore window layout when done
          (ediff-quit . winner-undo))
    :config
    (setq ediff-window-setup-function 'ediff-setup-windows-plain
          ediff-split-window-function 'split-window-horizontally
          ediff-merge-split-window-function 'split-window-horizontally))
#+end_src 

**** Expand Region

This is a really awesome package that provides semantic expansion and selection.
Check out the video at: https://emacsrocks.com/e09.html to find out more.
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  (use-package expand-region
    :bind (("C-=" . er/expand-region)
           ("C--" . er/contract-region))
    :config
    (defun treesit-mark-bigger-node ()
      "Use tree-sitter to mark regions."
      (let* ((root (treesit-buffer-root-node))
             (node (treesit-node-descendant-for-range root (region-beginning) (region-end)))
             (node-start (treesit-node-start node))
             (node-end (treesit-node-end node)))
        ;; Node fits the region exactly. Try its parent node instead.
        (when (and (= (region-beginning) node-start) (= (region-end) node-end))
          (when-let ((node (treesit-node-parent node)))
            (setq node-start (treesit-node-start node)
                  node-end (treesit-node-end node))))
        (set-mark node-end)
        (goto-char node-start)))
    (add-to-list 'er/try-expand-list 'treesit-mark-bigger-node))

#+end_src

**** GO To Mod

This one is really interesting. I usually get lost when moving between areas
of big files. This package helps me get back to my last change without marks or registers
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  ;; Goto last change
  (use-package goto-chg
    :bind ("C-," . goto-last-change))
#+end_src
**** Crux Mode
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  (use-package crux
    :bind
    (("C-a" . crux-move-beginning-of-line)
     ("C-x 4 t" . crux-transpose-windows)
     ("C-x K" . crux-kill-other-buffers)
     ("C-k" . crux-smart-kill-line))
    :config
    (crux-with-region-or-buffer indent-region)
    (crux-with-region-or-buffer untabify)
    (crux-with-region-or-point-to-eol kill-ring-save)
    (defalias 'rename-file-and-buffer #'crux-rename-file-and-buffer))
#+end_src

**** Kill Ring configuration
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"
  (setq kill-ring-max 200)

  ;; Save clipboard contents into kill-ring before replace them
  (setq save-interprogram-paste-before-kill t)

  ;; Kill & Mark things easily
  (use-package easy-kill
    :bind (([remap kill-ring-save] . easy-kill)
           ([remap mark-sexp] . easy-mark)))

  
#+end_src

