shared/home/dot-emacs.d/config.org
**** Undo as a Tree
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"

  (if emacs/>=28p
      (use-package vundo
        :bind ("C-x u" . vundo)
        :config (setq vundo-glyph-alist vundo-unicode-symbols))
    (use-package undo-tree
      :diminish
      :hook (after-init . global-undo-tree-mode)
      :init (setq undo-tree-visualizer-timestamps t
                  undo-tree-visualizer-diff t
                  undo-tree-enable-undo-in-region nil
                  undo-tree-auto-save-history nil)))


#+end_src

finally we close this section with some extra settings

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-edit.el"

  ;; Copy&paste GUI clipboard from text terminal
  (unless sys/win32p
    (use-package xclip
      :hook (after-init . xclip-mode)
      :config
      ;; @see https://github.com/microsoft/wslg/issues/15#issuecomment-1796195663
      (when (eq xclip-method 'wl-copy)
        (set-clipboard-coding-system 'gbk) ; for wsl
        (setq interprogram-cut-function
              (lambda (text)
                (start-process "xclip"  nil xclip-program "--trim-newline" "--type" "text/plain;charset=utf-8" text))))))

  ;; Open files as another user
  (unless sys/win32p
    (use-package sudo-edit))

  ;; Narrow/Widen
  (use-package fancy-narrow
    :diminish
    :hook (after-init . fancy-narrow-mode))

  ;; Hanlde minified code
  (use-package so-long
    :hook (after-init . global-so-long-mode))

  (provide 'init-edit)
#+end_src 


*** =init-completion.el= Completion systems related configuration

This configuration starts with some sensible defaults from the default emacs options.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-completion.el"
  ;;; init-completion.el --- Initialize completion configurations.	-*- lexical-binding: t -*-

  (eval-when-compile
    (require 'init-funcs)
    )

  (setq completion-styles '(basic substring initials flex orderless))
  (setq completion-category-defaults nil)

  (setq completion-ignore-case t)
  (setq read-buffer-completion-ignore-case t)
  (setq read-file-name-completion-ignore-case t)
  (setq-default case-fold-search t)   ; For general regexp

  (setq enable-recursive-minibuffers t)
  (setq read-minibuffer-restore-windows nil) ; Emacs 28
  (minibuffer-depth-indicate-mode 1)

  (setq minibuffer-default-prompt-format " [%s]") ; Emacs 29
  (minibuffer-electric-default-mode 1)


  (setq resize-mini-windows t)
  (setq read-answer-short t) ; also check `use-short-answers' for Emacs28

  ;; show keystrokes in Progress instantly
  (setq echo-keystrokes 0.1)
  (setq kill-ring-max 60) ; Keep it small


  ;; Do not allow the cursor to move inside the minibuffer prompt.  I
  ;; got this from the documentation of Daniel Mendler's Vertico
  ;; package: <https://github.com/minad/vertico>. Thanks to Protesilaos for
  ;; pointing this out.
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))

  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)


  (use-package emacs
    :init
    ;; TAB cycle if there are only few candidates
    (setq completion-cycle-threshold 3)

    ;; Only list the commands of the current modes
    (when (boundp 'read-extended-command-predicate)
      (setq read-extended-command-predicate
            #'command-completion-default-include-p))
    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (setq tab-always-indent 'complete))


#+end_src


**** Orderless

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-completion.el"
  ;; Optionally use the `orderless' completion style.
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion))))
    (orderless-component-separator #'orderless-escapable-split-on-space))

#+end_src

**** TODO VERTICO. VERTical Interactive COmpletion.
This one is an alternative to *helm*, and *Ivy*. It seems way faster than Ivy but performance
comparison to *helm* is still not clear for me. I may want to revisit *helm* at some point.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-completion.el"
  (use-package vertico
    :defer t
    :config
    ;; Different scroll margin
    (setq vertico-scroll-margin 0)
    ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
    (setq vertico-cycle t)
    (setq vertico-preselect 'directory)
    (defun my/vertico-insert ()
      (interactive)
      (let* ((mb (minibuffer-contents-no-properties))
             (lc (if (string= mb "") mb (substring mb -1))))
        (cond ((string-match-p "^[/~:]" lc) (self-insert-command 1 ?/))
              ((file-directory-p (vertico--candidate)) (vertico-insert))
              (t (self-insert-command 1 ?/)))))
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word)
                ("/" . #'my/vertico-insert)
                )
    :hook ((after-init . vertico-mode)
           (rfn-eshadow-update-overlay . vertico-directory-tidy)))

  ;; Let's have some nice icons in completion window.
  (use-package nerd-icons-completion
    :when (icons-displayable-p)
    :hook (vertico-mode . nerd-icons-completion-mode))

  ;; Get that juicy metada on our completion system
  (use-package marginalia
    :defer t
    :custom
    (marginalia-max-relative-age 0)
    (marginalia-align 'right)
    :hook (after-init . marginalia-mode)
    :bind (:map minibuffer-local-map
                ("M-A" . marginalia-cycle))
    )

#+end_src


The next one is a very interesting package that alters the way in which *Vertico*
shows the completion window. I would like to play more with it and see how
it matches my style as it kind of removes the minibuffer as the "list of completion options"
  
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-completion.el"
  (use-package vertico-posframe
    :hook (vertico-mode . vertico-posframe-mode)
    :init (setq vertico-posframe-poshandler
                #'posframe-poshandler-frame-center-near-bottom
                vertico-posframe-parameters
                '((left-fringe  . 8)
                  (right-fringe . 8))))

#+end_src

**** Consult.
Consult provides search and navigation commands based on Emacs completion function =complettin-read=.

Essentially provides tools for switching buffers and using tools like grep/ripgrep. It's probably
one of the biggest packages here, if not the one with the most customizations.

*TODO:* Remap keys to better match my working style.

*NOTE:* Taken directly from <https://github.com/seagle0128/.emacs.d/blob/master/lisp/init-completion.el>
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-completion.el"
  (use-package consult
    :bind (;; C-c bindings in `mode-specific-map'
           ("C-c M-x" . consult-mode-command)
           ("C-c h"   . consult-history)
           ("C-c k"   . consult-kmacro)
           ("C-c m"   . consult-man)
           ("C-c i"   . consult-info)
           ("C-c r"   . consult-ripgrep)
           ("C-c T"   . consult-theme)
           ("C-."     . consult-imenu)

           ("C-c c e" . consult-colors-emacs)
           ("C-c c w" . consult-colors-web)
           ("C-c c f" . describe-face)
           ("C-c c t" . consult-theme)

           ([remap Info-search]        . consult-info)
           ([remap isearch-forward]    . consult-line)
           ([remap recentf-open-files] . consult-recent-file)

           ;; C-x bindings in `ctl-x-map'
           ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
           ("C-x b"   . consult-buffer)              ;; orig. switch-to-buffer
           ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
           ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
           ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
           ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
           ;; Custom M-# bindings for fast register access
           ("M-#"     . consult-register-load)
           ("M-'"     . consult-register-store)        ;; orig. abbrev-prefix-mark (unrelated)
           ("C-M-#"   . consult-register)
           ;; Other custom bindings
           ("M-y"     . consult-yank-pop)                ;; orig. yank-pop
           ;; M-g bindings in `goto-map'
           ("M-g e"   . consult-compile-error)
           ("M-g f"   . consult-flymake)               ;; Alternative: consult-flycheck
           ("M-g g"   . consult-goto-line)             ;; orig. goto-line
           ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
           ("M-g o"   . consult-outline)               ;; Alternative: consult-org-heading
           ("M-g m"   . consult-mark)
           ("M-g k"   . consult-global-mark)
           ("M-g i"   . consult-imenu)
           ("M-g I"   . consult-imenu-multi)
           ;; M-s bindings in `search-map'
           ("M-s d"   . consult-find)
           ("M-s D"   . consult-locate)
           ("M-s g"   . consult-grep)
           ("M-s G"   . consult-git-grep)
           ("M-s r"   . consult-ripgrep)
           ("M-s l"   . consult-line)
           ("M-s L"   . consult-line-multi)
           ("M-s k"   . consult-keep-lines)
           ("M-s u"   . consult-focus-lines)
           ;; Isearch integration
           ("M-s e"   . consult-isearch-history)
           :map isearch-mode-map
           ("M-e"     . consult-isearch-history)       ;; orig. isearch-edit-string
           ("M-s e"   . consult-isearch-history)       ;; orig. isearch-edit-string
           ("M-s l"   . consult-line)                  ;; needed by consult-line to detect isearch
           ("M-s L"   . consult-line-multi)            ;; needed by consult-line to detect isearch

           ;; Minibuffer history
           :map minibuffer-local-map
           ("C-s" . (lambda ()
                      "Insert the selected region or current symbol at point."
                      (interactive)
                      (insert (with-current-buffer
                                  (window-buffer (minibuffer-selected-window))
                                (or (and transient-mark-mode mark-active (/= (point) (mark))
                                         (buffer-substring-no-properties (point) (mark)))
                                    (thing-at-point 'symbol t)
                                    "")))))
           ("M-s" . consult-history)                 ;; orig. next-matching-history-element
           ("M-r" . consult-history))                ;; orig. previous-matching-history-element

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :init
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (with-eval-after-load 'xref
      (setq xref-show-xrefs-function #'consult-xref
            xref-show-definitions-function #'consult-xref))

    ;; More utils
    (defvar consult-colors-history nil
      "History for `consult-colors-emacs' and `consult-colors-web'.")

    ;; No longer preloaded in Emacs 28.
    (autoload 'list-colors-duplicates "facemenu")
    ;; No preloaded in consult.el
    (autoload 'consult--read "consult")

    (defun consult-colors-emacs (color)
      "Show a list of all supported colors for a particular frame.

    You can insert the name (default), or insert or kill the hexadecimal or RGB
    value of the selected COLOR."
      (interactive
       (list (consult--read (list-colors-duplicates (defined-colors))
                            :prompt "Emacs color: "
                            :require-match t
                            :category 'color
                            :history '(:input consult-colors-history)
                            )))
      (insert color))

    ;; Adapted from counsel.el to get web colors.
    (defun consult-colors--web-list nil
      "Return list of CSS colors for `counsult-colors-web'."
      (require 'shr-color)
      (sort (mapcar #'downcase (mapcar #'car shr-color-html-colors-alist)) #'string-lessp))

    (defun consult-colors-web (color)
      "Show a list of all CSS colors.\

    You can insert the name (default), or insert or kill the hexadecimal or RGB
    value of the selected COLOR."
      (interactive
       (list (consult--read (consult-colors--web-list)
                            :prompt "Color: "
                            :require-match t
                            :category 'color
                            :history '(:input consult-colors-history)
                            )))
      (insert color))
    :config
    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
    (setq consult-preview-key '(:debounce 1.0 any))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-goto-line
     consult-theme :preview-key '(:debounce 0.5 any))

    ;; Optionally configure the narrowing key.
    ;; Both <and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; "C-+"

    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help))

  (use-package consult-flyspell
    :bind ("M-g s" . consult-flyspell))

  (use-package consult-flycheck
    :bind ("M-g c" . consult-flycheck))



  (use-package consult-yasnippet
    :bind ("M-g y" . consult-yasnippet))

#+end_src

