shared/home/dot-emacs.d/config.org
*** =init-prog.el= Programming Generalities

Here are the settings related to all programming modes. Specfic customizations
done for each programming language I plan to use are stored in their own config file.


#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-prog.el"
          ;;; init-prog.el --- Initialize Programmin related configurations.	-*- lexical-binding: t -*-

  ;; Show function arglist or variable docstring
  (use-package eldoc
    :ensure nil
    :diminish
    :config
    (when (childframe-workable-p)
      (use-package eldoc-box
        :diminish (eldoc-box-hover-mode eldoc-box-hover-at-point-mode)
        :custom
        (eldoc-box-lighter nil)
        (eldoc-box-only-multi-line t)
        (eldoc-box-clear-with-C-g t)
        :custom-face
        (eldoc-box-border ((t (:inherit posframe-border :background unspecified))))
        (eldoc-box-body ((t (:inherit tooltip))))
        :hook ((eglot-managed-mode . eldoc-box-hover-at-point-mode))
        :config
        ;; Prettify `eldoc-box' frame
        (setf (alist-get 'left-fringe eldoc-box-frame-parameters) 12
              (alist-get 'right-fringe eldoc-box-frame-parameters) 12))))



  ;; Cross-referencing commands
  (use-package xref
    :bind (("M-g ." . xref-find-definitions)
           ("M-g ," . xref-go-back))
    :init
    ;; Use faster search tool
    (when (executable-find "rg")
      (setq xref-search-program 'ripgrep))

    ;; Select from xref candidates in minibuffer
    (setq xref-show-definitions-function #'xref-show-definitions-completing-read
          xref-show-xrefs-function #'xref-show-definitions-completing-read))


  ;; Code styles
  (use-package editorconfig
    :diminish
    :hook (after-init . editorconfig-mode))


  ;; Run commands quickly
  (use-package quickrun
    :bind (("C-<f5>" . quickrun)
           ("C-c X"  . quickrun)))



  ;; Browse devdocs.io documents using EWW
  (use-package devdocs
    :autoload (devdocs--installed-docs devdocs--available-docs)
    :bind (:map prog-mode-map
                ("M-<f1>" . devdocs-dwim)
                ("C-h D"  . devdocs-dwim))
    :init
    (defconst devdocs-major-mode-docs-alist
      '((c-mode          . ("c"))
        (c++-mode        . ("cpp"))
        (python-mode     . ("python~3.10" "python~2.7"))
        (ruby-mode       . ("ruby~3.1"))

        (rustic-mode     . ("rust"))
        (css-mode        . ("css"))
        (html-mode       . ("html"))
        (julia-mode      . ("julia~1.8"))
        (js-mode         . ("javascript" "jquery"))
        (js2-mode        . ("javascript" "jquery"))
        (emacs-lisp-mode . ("elisp")))
      "Alist of major-mode and docs.")

    (mapc
     (lambda (mode)
       (add-hook (intern (format "%s-hook" (car mode)))
                 (lambda ()
                   (setq-local devdocs-current-docs (cdr mode)))))
     devdocs-major-mode-docs-alist)

    (setq devdocs-data-dir (expand-file-name "devdocs" user-emacs-directory))

    (defun devdocs-dwim()
      "Look up a DevDocs documentation entry.

  Install the doc if it's not installed."
      (interactive)
      ;; Install the doc if it's not installed
      (mapc
       (lambda (slug)
         (unless (member slug (let ((default-directory devdocs-data-dir))
                                (seq-filter #'file-directory-p
                                            (when (file-directory-p devdocs-data-dir)
                                              (directory-files "." nil "^[^.]")))))
           (mapc
            (lambda (doc)
              (when (string= (alist-get 'slug doc) slug)
                (devdocs-install doc)))
            (devdocs--available-docs))))
       (alist-get major-mode devdocs-major-mode-docs-alist))

      ;; Lookup the symbol at point
      (devdocs-lookup nil (thing-at-point 'symbol t))))
#+end_src



We define an assortment of programming modes and settings that are usually in-use
along with major programming modes.
#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-prog.el"


  ;; Better Compilation
  ;; kill compilation process before starting another
  (setq-default compilation-always-kill t)
  ;; save all buffers on `compile'
  (setq-default compilation-ask-about-save nil)
  ;; Get compilation buffer to autoscroll. Always!!!
  (setq-default compilation-scroll-output t)

  (setq mode-compile-always-save-buffer-p nil)

  ;; Misc. programming modes
  (use-package csv-mode)
  (unless emacs/>=29p
    (use-package csharp-mode))
  (use-package cask-mode)
  (use-package cmake-mode)
  (use-package dart-mode) ; Welcome Flutter!
  (use-package julia-mode)
  (use-package lua-mode)
  (use-package mermaid-mode)
  (use-package powershell)
  (use-package scala-mode)
  (use-package swift-mode)
  (use-package v-mode)
  (use-package vimrc-mode)
  (use-package yaml-mode)

  ;; checkout https://github.com/protocolbuffers/protobuf
  (use-package protobuf-mode
    :hook (protobuf-mode . (lambda ()
                             (setq imenu-generic-expression
                                   '((nil "^[[:space:]]*\\(message\\|service\\|enum\\)[[:space:]]+\\([[:alnum:]]+\\)" 2))))))

  (use-package nxml-mode
    :ensure nil
    :mode (("\\.xaml$" . xml-mode)))

  ;; Fish shell
  (use-package fish-mode
    :hook (fish-mode . (lambda ()
                         (add-hook 'before-save-hook
                                   #'fish_indent-before-save))))


  (use-package docker
    :defines docker-image-run-arguments
    :bind ("C-c D" . docker)
    :init (setq docker-image-run-arguments '("-i" "-t" "--rm")
                docker-container-shell-file-name "/bin/bash"))

  ;;`tramp-container' is builtin since 29
  (unless emacs/>=29p
    (use-package docker-tramp))

  (use-package dockerfile-mode)

  (provide 'init-prog)  
#+end_src

*** =init-java.el= Java specific settings

I still use and prefere JAVA for most code intensive and performant code when Ruby is not enough. This is
my atempt at making Emacs a decent Java Editor for my needs.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-java.el"
  ;; init-java.el --- Initialize Java configurations.	-*- lexical-binding: t -*-

  (use-package eglot-java
    :hook (java-mode-hook . eglot-java-mode)
    :bind (
           ("C-c l n" . eglot-java-file-new)
           ("C-c l x" . eglot-java-run-main)
           ("C-c l t" . eglot-java-run-test)
           ("C-c l N" . eglot-java-project-new)
           ("C-c l T" . eglot-java-project-build-task)
           ("C-c l R" . eglot-java-project-build-refresh)
           )

    )
#+end_src

*** =init-python.el= Python specific settings

Python is very used lately even if I hate the tooling. Here is my attempt at
making it sane.

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-python.el"
  ;; init-python.el --- Initialize python configurations.	-*- lexical-binding: t -*-

  (use-package python
    :ensure nil
    :hook (inferior-python-mode . (lambda ()
                                    (process-query-on-exit-flag
                                     (get-process "python"))))
    :init
    ;; Disable readline based native completion
    (setq python-shell-completion-native-enable nil)
    :config

    (defun my-python-repl-command ()
      (interactive)
      (call-interactively 'pipenv-activate)
      (call-interactively 'run-python)
      )

    ;; Default to Python 3. Prefer the versioned Python binaries since some
    ;; systems stupidly make the unversioned one point at Python 2.
    (when (and (executable-find "python3")
               (string= python-shell-interpreter "python"))
      (setq python-shell-interpreter "python3"))

    ;; Env vars
    (with-eval-after-load 'exec-path-from-shell
      (exec-path-from-shell-copy-env "PYTHONPATH")))


  ;; ;; Required to easily switch virtual envs
  ;; via the menu bar or with `pyvenv-workon`
  ;; Setting the `WORKON_HOME` environment variable points
  ;; at where the envs are located. I use miniconda.
  (use-package pyvenv
    :defer t
    :config
    ;; Setting work on to easily switch between environments
    (setenv "WORKON_HOME" (expand-file-name "~/.local/share/virtualenvs/"))
    ;; Display virtual envs in the menu bar
    (setq pyvenv-menu t)
    ;; Restart the python process when switching environments
    (add-hook 'pyvenv-post-activate-hooks (lambda ()
                                            (pyvenv-restart-python)))
    :hook (python-mode . pyvenv-mode))

  (use-package pipenv
    :defer t
    :hook (python-mode . pipenv-mode)
    :config
    (setq pipenv-projectile-after-switch-function  #'pipenv-projectile-after-switch-extended))


  ;; Buffer formatting on save
  (use-package blacken
    :defer t
    :custom
    (blacken-allow-py36 t)
    (blacken-skip-string-normalization t)
    :hook (python-mode . blacken-mode))


  ;; numpy docstring for python
  (use-package numpydoc
    :defer t
    :custom
    (numpydoc-insert-examples-block nil)
    (numpydoc-template-long nil)
    :bind (:map python-mode-map
                ("C-c C-n" . numpydoc-generate)))

  (provide 'init-python)
#+end_src

