shared/home/dot-emacs.d/config.org
*** TODO =init-ruby.el= Python specific settings

Ruby is my language of choice these days for anything web-development related.
Here are the settings that I consider (or have found to be so far) the best for
Ruby and Ruby on Rails development.


#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-ruby.el"
  ;; init-python.el --- Initialize ruby configurations.	-*- lexical-binding: t -*-

  ;; Run a Ruby process in a buffer
  (use-package inf-ruby
    :hook ((ruby-mode . inf-ruby-minor-mode)
           (compilation-filter . inf-ruby-auto-enter)))

  ;; Ruby YARD comments
  (use-package yard-mode
    :diminish
    :hook (ruby-mode . yard-mode))

  ;; Ruby refactoring helpers
  (use-package ruby-refactor
    :diminish
    :hook (ruby-mode . ruby-refactor-mode-launch))

  ;; Yet Another RI interface for Emacs
  (use-package yari
    :bind (:map ruby-mode-map ([f1] . yari)))

  ;; RSpec
  (use-package rspec-mode
    :diminish
    :autoload rspec-install-snippets
    :hook (dired-mode . rspec-dired-mode)
    :config (with-eval-after-load 'yasnippet
              (rspec-install-snippets)))

  (use-package rbenv
    :config
    (setq rbenv-show-active-ruby-in-modeline nil)
    ;;(global-rbenv-mode)
    :hook
    ((ruby-mode ruby-ts-mode ) . global-rbenv-mode)
    )

  (use-package bundler
    ;; For Ruby package management
    )

  (provide 'init-ruby)
#+end_src

*** =init-web.el= Web, JavaScript and Typescript related settings

#+begin_src emacs-lisp :tangle "juank-emacs-modules/init-web.el"
  ;; init-web.el --- Initialize web configurations.	-*- lexical-binding: t -*-

  ;; CSS
  (use-package css-mode
    :init (setq css-indent-offset 2))

  ;; SCSS
  (use-package scss-mode
    :init (setq scss-compile-at-save nil))

  ;; LESS
  (unless (fboundp 'less-css-mode)
    (use-package less-css-mode))

  ;; JSON
  (unless (fboundp 'js-json-mode)
    (use-package json-mode))

  ;; JavaScript
  (use-package js
    :init (setq js-indent-level 2))

  (use-package js2-mode
    :mode (("\\.js\\'" . js2-mode)
           ("\\.jsx\\'" . js2-jsx-mode))
    :interpreter (("node" . js2-mode)
                  ("node" . js2-jsx-mode))
    :hook ((js2-mode . js2-imenu-extras-mode)
           (js2-mode . js2-highlight-unused-variables-mode))
    :config
    ;; Use default keybindings for lsp
    (unbind-key "M-." js2-mode-map))

  ;; Format HTML, CSS and JavaScript/JSON
  ;; Install: npm -g install prettier
  (when (executable-find "prettier")
    (use-package prettier
      :diminish
      :hook ((js-mode js2-mode css-mode sgml-mode web-mode typescript-mode) . prettier-mode)
      :init (setq prettier-pre-warm 'none)))

  ;; Live browser JavaScript, CSS, and HTML interaction
  (use-package skewer-mode
    :diminish
    :functions diminish
    :hook (((js-mode js2-mode)   . skewer-mode)
           (css-mode             . skewer-css-mode)
           ((html-mode web-mode) . skewer-html-mode))
    :init
    ;; diminish
    (with-eval-after-load 'skewer-css
      (diminish 'skewer-css-mode))
    (with-eval-after-load 'skewer-html
      (diminish 'skewer-html-mode)))

  (use-package typescript-mode
    :mode ( "\\.ts\\'" . typescript-mode))


  (use-package jtsx

    :mode (("\\.jsx?\\'" . jtsx-jsx-mode)
           ("\\.tsx?\\'" . jtsx-tsx-mode))
    :commands jtsx-install-treesit-language
    :hook ((jtsx-jsx-mode . hs-minor-mode)
           (jtsx-tsx-mode . hs-minor-mode))
    ;;:custom
    ;; Optional customizations
    ;; (js-indent-level 2)
    ;; (typescript-ts-mode-indent-offset 2)
    ;; (jtsx-switch-indent-offset 0)
    ;; (jtsx-indent-statement-block-regarding-standalone-parent nil)
    ;; (jtsx-jsx-element-move-allow-step-out t)
    ;; (jtsx-enable-jsx-electric-closing-element t)
    ;; (jtsx-enable-electric-open-newline-between-jsx-element-tags t)
    ;; (jtsx-enable-jsx-element-tags-auto-sync nil)
    ;; (jtsx-enable-all-syntax-highlighting-features t)
    )


  (use-package add-node-modules-path
    :custom
    (add-node-modules-path-command '("pnpm bin" "pnpm bin -w"))) 

  ;; Run Mocha or Jasmine tests
  (use-package mocha
    :config (use-package mocha-snippets))

  ;; Major mode for CoffeeScript code
  (use-package coffee-mode
    :config (setq coffee-tab-width 2))

  ;; Major mode for editing web templates
  (use-package web-mode
    :mode "\\.\\(phtml\\|php\\|[gj]sp\\|as[cp]x\\|erb\\|djhtml\\|html?\\|hbs\\|ejs\\|jade\\|swig\\|tm?pl\\|vue\\)$"
    :config
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2))

  ;; Adds node_modules/.bin directory to `exec_path'
  (use-package add-node-modules-path
    :hook ((web-mode js-mode js2-mode) . add-node-modules-path))

  (use-package haml-mode)
  (use-package php-mode)

  ;; REST
  (use-package restclient
    :mode ("\\.http\\'" . restclient-mode)
    :config
    (use-package restclient-test
      :diminish
      :hook (restclient-mode . restclient-test-mode)))

  (provide 'init-web)
#+end_src






** Next
